In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\aless\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: six in c:\users\aless\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in c:\users\aless\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\aless\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: jedi>=0.16 in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: decorator in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pickleshare in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: backcall in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: traitlets>=4.2 in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\aless\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\aless\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\aless\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\aless\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=41cafba2bea56d19a141d79138abaecd3107c9e7ea833fd906c4a6350594f92e
  Stored in directory: c:\users\aless\appdata\local\pip\cache\wheels\75\f7\28\77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.2

In [2]:
import sqlalchemy

In [5]:
sqlalchemy.create_engine('sqlite:///Sport.db')

Engine(sqlite:///Sport.db)

In [7]:
%load_ext sql

In [8]:
%sql sqlite:///Sport.db

In [9]:
%%sql

SELECT * FROM GIOCATORI

 * sqlite:///Sport.db
Done.

[('Malizia', 'Alessio', 'Pisa', 10, 34),
 ('Matera', 'Davide', 'Firenze', 15, 32),
 ('Rossi', 'Giovanni', 'Firenze', 4, 33),
 ('Verdi', 'Giuseppe', 'Empoli', None, None)]

In [10]:
result = %sql SELECT * FROM GIOCATORI

 * sqlite:///Sport.db
Done.

In [11]:
result

[('Malizia', 'Alessio', 'Pisa', 10, 34),
 ('Matera', 'Davide', 'Firenze', 15, 32),
 ('Rossi', 'Giovanni', 'Firenze', 4, 33),
 ('Verdi', 'Giuseppe', 'Empoli', None, None)]

In [13]:
df = result.DataFrame()

In [14]:
df.head()

   Cognome      Nome  Squadra  NumMaglia   Età
0  Malizia   Alessio     Pisa       10.0  34.0
1   Matera    Davide  Firenze       15.0  32.0
2    Rossi  Giovanni  Firenze        4.0  33.0
3    Verdi  Giuseppe   Empoli        NaN   NaN

In [17]:
result2 = %sql SELECT * FROM GIOCATORI WHERE Squadra = 'Firenze'

 * sqlite:///Sport.db
Done.

In [18]:
result2

[('Matera', 'Davide', 'Firenze', 15, 32),
 ('Rossi', 'Giovanni', 'Firenze', 4, 33)]

In [19]:
df2 = result2.DataFrame()

In [20]:
df2

  Cognome      Nome  Squadra  NumMaglia  Età
0  Matera    Davide  Firenze         15   32
1   Rossi  Giovanni  Firenze          4   33